Examining Model:  ['mnist', 'LargeCNN.h5'] 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 16, 28, 28)        160       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 16, 26, 26)        2320      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 13, 13)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 16, 13, 13)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 32, 13, 13)        4640      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 32, 11, 11)        9248      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 32, 5, 5)          0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 32, 5, 5)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 800)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                51264     
_________________________________________________________________
dropout_3 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 10)                650       
=================================================================
Total params: 68,282
Trainable params: 68,282
Non-trainable params: 0
_________________________________________________________________
Total flops: 136,238



Examining Model:  ['mnist', 'SmallCNN.h5'] 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 32, 26, 26)        320       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 13, 13)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 13, 13)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 5408)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                346176    
_________________________________________________________________
dropout_2 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 10)                650       
=================================================================
Total params: 347,146
Trainable params: 347,146
Non-trainable params: 0
_________________________________________________________________
Total flops: 830,327



Examining Model:  ['mnist', 'DeepCNN.h5'] 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 16, 28, 28)        160       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 16, 26, 26)        2320      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 16, 13, 13)        0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 16, 13, 13)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 32, 13, 13)        4640      
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 32, 11, 11)        9248      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 32, 5, 5)          0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 32, 5, 5)          0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 800)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 64)                51264     
_________________________________________________________________
dense_4 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_5 (Dense)              (None, 16)                528       
_________________________________________________________________
dropout_6 (Dropout)          (None, 16)                0         
_________________________________________________________________
dense_6 (Dense)              (None, 10)                170       
=================================================================
Total params: 70,410
Trainable params: 70,410
Non-trainable params: 0
_________________________________________________________________
Total flops: 970,727



Examining Model:  ['mnist', 'MediumCNN.h5'] 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_2 (Conv2D)            (None, 32, 28, 28)        320       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 32, 26, 26)        9248      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 32, 13, 13)        0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 32, 13, 13)        0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 5408)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 64)                346176    
_________________________________________________________________
dropout_4 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 10)                650       
=================================================================
Total params: 356,394
Trainable params: 356,394
Non-trainable params: 0
_________________________________________________________________
Total flops: 1,683,249



Examining Model:  ['cifar10', 'LargeCNN.h5'] 
_______________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 32, 32, 32)        896       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 30, 30)        9248      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 15, 15)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 15, 15)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 15, 15)        18496     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 64, 13, 13)        36928     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 64, 6, 6)          0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 64, 6, 6)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2304)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               1180160   
_________________________________________________________________
dropout_3 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 10)                5130      
=================================================================
Total params: 1,250,858
Trainable params: 1,250,858
Non-trainable params: 0
_________________________________________________________________
Total flops: 4,183,551



Examining Model:  ['cifar10', 'SmallCNN.h5'] 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 64, 30, 30)        1792      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 64, 15, 15)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 64, 15, 15)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 14400)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               3686656   
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 10)                2570      
=================================================================
Total params: 3,691,018
Trainable params: 3,691,018
Non-trainable params: 0
_________________________________________________________________
Total flops: 11,564,936



Examining Model:  ['cifar10', 'DeepCNN.h5'] 
______________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 32, 32, 32)        896       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 30, 30)        9248      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 15, 15)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 15, 15)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 15, 15)        18496     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 64, 13, 13)        36928     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 64, 6, 6)          0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 64, 6, 6)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2304)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               1180160   
_________________________________________________________________
dense_2 (Dense)              (None, 256)               131328    
_________________________________________________________________
dense_3 (Dense)              (None, 128)               32896     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 10)                1290      
=================================================================
Total params: 1,411,242
Trainable params: 1,411,242
Non-trainable params: 0
_________________________________________________________________
Total flops: 14,385,240



Examining Model:  ['cifar10', 'MediumCNN.h5'] 
_______________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 64, 32, 32)        1792      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 64, 30, 30)        36928     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 64, 15, 15)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 64, 15, 15)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 14400)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               3686656   
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 10)                2570      
=================================================================
Total params: 3,727,946
Trainable params: 3,727,946
Non-trainable params: 0
_________________________________________________________________
Total flops: 21,840,354
